crud/app/controllers/goods_controller.rb

SELECT `goods`.* FROM `goods`
---
  def index
    @goods = Good.all

INSERT INTO `goods` (`name`, `price`, `created_at`, `updated_at`) VALUES ('pen', '200', '2022-03-04 09:28:41', '2022-03-04 09:28:41')
---
  def create
    puts "==params is: "
    Good.create :name => params[:name],
    :price => params[:price]

UPDATE `goods` SET `name` = NULL, `price` = NULL, `updated_at` = '2022-03-05 08:13:57' WHERE `goods`.`id` = 2
---
  def update
    #@goods.name = params[:name]
    #@goods.price = params[:price]
    #@goods.save

    @good.update params[:good]

DELETE FROM `goods` WHERE `goods`.`id` = 8
---
  def destroy
    @good.delete